Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: མིག་གི་དབང་པོ་སྡོམ་པས་མ་བསྡམས་པར་གནས་པ་ནི་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་དག་འབྱུང་བས་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་སེམས་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: When he abides with his eye faculty unrestrained, because his longing and despair toward the world arise, evil and unwholesome elements follow his mind.

source: །དེ་རྣམས་བསྡམ་པའི་ཕྱིར་བསྒྲུབ་ཅིང་བསྲུང་བར་མིག་གི་དབང་པོས་མིག་གི་དབང་པོ་སྡོམ་པར་བྱེད་དོ།
en: In order to restrain them, he practices, protects himself, and restrains his eye faculty with his eye faculty.

source: །དེ་བཞིན་དུ་རྣ་བས་སྒྲ་དང་སྣས་དྲི་དང་། ལྕེས་རོ་དང་། ལུས་ཀྱིས་རེག་བྱ་དང་། ཡིད་ཀྱིས་ཆོས་རྣམས་ཤེས་ནས་མཚན་མར་མི་འཛིན། མངོན་རྟགས་སུ་མི་འཛིན་ཏོ། །གཞི་གང་གི་ཕྱིར་ཞེ་ན།
en: Likewise, when he cognizes sounds with his ears, smells with his nose, tastes with his tongue, tangible objects with his body, and mental objects with his mind, he does not grasp them with their characteristics and secondary marks. Why?

source: ཡིད་ཀྱི་དབང་པོ་སྡོམ་པས་མ་བསྡམས་པར་གནས་པ་ནི་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་དག་འབྱུང་བས་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་སེམས་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: When he abides with his mental faculty unrestrained, because his longing and despair toward the world arise, evil and unwholesome elements follow his mind.

source: །དེ་རྣམས་བསྡམ་པའི་ཕྱིར་ཡིད་ཀྱི་དབང་པོས་ཡིད་ཀྱི་དབང་པོ་སྡོམ་པར་བྱེད་དོ།
en: In order to restrain them, he practices, protects himself, and restrains his mental faculty with his mental faculty.

source: །དེ་འཕགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དེ་དང་། དབང་པོ་རྣམས་ཀྱི་སྒོ་བསྡམས་པ་དེ་དང་ལྡན་པས་ནང་གི་བདེ་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཉམས་སུ་མྱོང་ཞིང་། དེ་འགྲོ་བ་དང་ལྡོག་པ་ལ་ཤེས་བཞིན་དུ་གནས་པ་ཡིན།
en: “Because he has that noble aggregate of moral conduct, and the doors of his faculties are restrained, he experiences inner, faultless happiness and abides with vigilance in going back and forth.

source: ལྟ་བ་དང་། རྣམ་པར་ལྟ་བ་དང་། བསྐུམ་པ་དང་། བརྐྱང་བ་དང་། སྣམ་སྦྱར་དང་། ཆོས་གོས་དང་། ལྷུང་བཟེད་ཐོགས་པ་དང་། འགྲོ་བ་དང་། འགྲེང་བ་དང་། འདུག་པ་དང་། ཉལ་བ་དང་། མི་ཉལ་བ་དང་། སྨྲ་བ་དང་། མི་སྨྲ་བ་དང་། གཉིད་ཀྱིས་དུབ་པ་བསལ་བ་ལ་ཤེས་བཞིན་དུ་གནས་པ་ཡིན་ནོ།
en: He also abides with vigilance while watching, observing, bending and stretching his body, holding his outer robe, robe, and bowl, walking, standing, sitting, lying down, not sleeping, talking, not talking, sleeping, being tired, and resting.

source: །དེ་འཕགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དེ་དང་། དབང་པོ་རྣམས་ཀྱི་སྒོ་བསྡམས་པ་དེ་དང་། དྲན་པ་དང་ཤེས་བཞིན་མཆོག་དེ་དང་ལྡན་པས་ནང་གི་བདེ་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་ཉམས་སུ་མྱོང་ཞིང་དེ་གནས་མལ་དབེན་པ་དགོན་པ་དང་། ཤིང་དྲུང་དང་། ཁང་སྟོང་དག་ཏུ་གནས་པ་ཡིན་ཏེ། དེ་དགོན་པར་སོན་ཀྱང་རུང་། ཤིང་དྲུང་དུ་སོན་ཀྱང་རུང་།
en: “Because he has that noble aggregate of moral conduct, the doors of his faculties are restrained, and he is mindful and supremely vigilant, he experiences inner, faultless happiness and abides in solitary dwelling places: wilderness, under trees, and in empty houses.

source: ཁང་སྟོང་དུ་སོན་ཀྱང་རུང་འདུག་སྟེ།
en: He sits in any of these places.

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ལུས་དྲང་པོར་བསྲང་སྟེ་དྲན་པ་མངོན་དུ་ཕྱོགས་པར་བཞག་ནས་དེ་འཇིག་རྟེན་ལ་བརྣབ་སེམས་སྤངས་ཏེ།
en: Sitting with his legs crossed, he straightens his back and focuses his mind on a point in front of him. He has abandoned longing for the world.

source: བརྣབ་སེམས་དང་བྲལ་བའི་སེམས་ཀྱིས་ལན་མང་དུ་གནས་ཤིང་བརྣབ་སེམས་ལས་སེམས་ཡོངས་སུ་སྦྱོང་བ་ཡིན་ནོ།
en: With a mind free from longing, he stays in this manner many times, and his mind is completely cleansed of longing.

source: །འཇིག་རྟེན་ལ་གནོད་སེམས་དང་། རྨུགས་པ་དང་། གཉིད་དང་། རྒོད་པ་དང་། འགྱོད་པ་དང་། ཐེ་ཚོམ་སྤངས་ཏེ། ཡིད་གཉིས་ལས་རྒལ་བ་ཡིན།
en: He has abandoned malice and despair, depression, tiredness, restlessness, regret, and doubt toward the world.

source: ཐེ་ཚོམ་ལས་རྒལ་བ་ཡིན། དགེ་བའི་ཆོས་རྣམས་ལ་ངེས་པ་ཐོབ་པ་ཡིན།
en: He has overcome hesitancy and doubt and achieved certainty about virtuous things.

source: ཐེ་ཚོམ་ལས་སེམས་ཡོངས་སུ་སྦྱོང་བ་ཡིན་ནོ།
en: His mind is completely cleansed of doubt.

source: །མ་སྡུག་དཔེར་ན་མི་ཞིག་གིས་སྐྱིན་པོ་ཞིག་བླངས་ནས་ལས་ཀྱི་མཐའ་རྣམས་ལ་བརྩོན་པར་བྱས་ཏེ།
en: “Ambāṣṭha, as an example, a man, having gotten into debt, exerts himself for his business.

source: དེའི་ལས་ཀྱི་མཐའ་དེ་རྣམས་གྲུབ་ནས་དེས་དེ་ལས་བུ་ལོན་དེ་ཡང་ཁྱེར་ལ། དེ་ལ་ཆུང་མ་གསོ་བ་ཆོག་ཙམ་ཞིག་ཀྱང་ཡོད་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When he succeeds in the business, he pays off the debt out of the profits and still has enough wealth to feed his wife.

source: བདག་གིས་སྐྱིན་པོ་བླངས་ནས་ལས་ཀྱི་མཐའ་རྣམས་ལ་བརྩོན་པར་བྱས་ཏེ།
en: He thinks, ‘Having gotten into debt, I exerted myself for my business.

source: བདག་གི་ལས་ཀྱི་མཐའ་དེ་རྣམས་གྲུབ་ནས་བདག་གིས་དེ་ལས་བུ་ལོན་ཡང་གཞལ། བདག་ལ་ཆུང་མ་གསོ་བ་ཆོག་ཙམ་ཞིག་ཀྱང་ཡོད་དོ་སྙམ་སྟེ། དེ་གཞི་དེ་ལས་བདེ་བར་གྱུར།
en: When I succeeded in the business, I paid off the debt out of the profits and still have enough wealth to feed my wife.’ He becomes happy and satisfied for that reason.

source: ཡིད་བདེ་བར་གྱུར་པ་དང་། མ་སྡུག་དཔེར་ན་མི་ནད་པ་ནད་ཚབས་ཆེ་བ་སྡུག་བསྔལ་བ་ཞིག་ཡོད་ལ།
en: “Ambāṣṭha, as another example, there is a man who is sick, seriously ill, afflicted with a painful illness.

source: དེ་ཟས་ཟོས་པ་ནི་ལུས་ལ་འཇུར་མི་བཏུབ།
en: He is not able to digest the food he has eaten.

source: སྐོམ་འཐུངས་པ་ནི་ཁོང་དུ་གནོད་པར་གྱུར་པ་ལས་དེ་དུས་གཞན་ཞིག་ན་ནད་མེད་ཅིང་སྟོབས་དང་ལྡན་ལ་བདེ་བར་གྱུར་ཏེ།
en: The drink he has drunk hurts his stomach. But later he becomes free from illness, stronger, and comfortable;

source: དེས་ཁ་ཟས་ཟོས་པ་འཇུར་བཏུབ། སྐོམ་འཐུངས་པ་ནི་ཁོང་དུ་གནོད་པར་མ་གྱུར་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: he is able to digest the food he has eaten, and the drink he has drunk does not hurt his stomach.

source: འདི་ལྟར་བདག་སྔོན་ན་བ་ནད་ཚབས་ཆེ་བ་སྡུག་བསྔལ་བར་གྱུར་པ་ན་བདག་གིས་ཁ་ཟས་ཟོས་པ་ནི་ལུས་ལ་འཇུར་མི་བཏུབ།
en: He thinks, ‘I was once sick, seriously ill, afflicted with a painful illness;

source: སྐོམ་འཐུངས་པ་ནི་ཁོང་དུ་གནོད་པར་གྱུར་པ་ལས།
en: then I was not able to digest the food I had eaten, and the drink I had drunk hurt my stomach.

source: ད་ནི་འདི་ལྟར་བདག་ནད་མེད་ཅིང་སྟོབས་དང་ལྡན་པས་བདེ་བར་གྱུར་ཏེ།
en: But now I am free from illness, stronger, and comfortable;

source: བདག་གིས་ཟས་ཟོས་པ་ནི་ལུས་ལ་འཇུར་བཏུབ། སྐོམ་འཐུངས་པ་ནི་ཁོང་དུ་གནོད་པར་མ་གྱུར་ཏོ་སྙམ་སྟེ། དེ་གཞི་དེ་ལས་བདེ་བ་དང་། ཡིད་བདེ་བར་གྱུར་པ་དང་། མ་སྡུག་དཔེར་ན་མི་ཞིག་བྲན་དུ་གྱུར་ཏེ།
en: I am able to digest the food I eat, and the drink I drink does not hurt my stomach.’ He becomes happy and satisfied for that reason.

source: མངག་གཞུག་པ་དང་། གོ་རེ་ལོང་བ་དང་། ལྟོ་གོལ་དང་། རང་དབང་མེད་པར་གྱུར་པ་ལས།
en: “Ambāṣṭha, as another example, a man becomes a slave, servant, retainer, or bondman and becomes dependent.

source: དེ་དུས་གཞན་ཞིག་ན་བྲན་མི་བྱེད་པར་གྱུར་ཏེ། མངག་གཞུག་པ་མི་བྱེད།
en: But later he is released from being a slave, servant, retainer, or bondman.

source: གོ་རེ་ལོང་མི་བྱེད། ལྟོ་གོལ་མི་བྱེད་དེ། རང་དབང་ཡོད་ནས། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལྟར་བདག་སྔོན་བྲན་དུ་གྱུར་པ་ན་མངག་གཞུག་པ་དང་། གོ་རེ་ལོང་བ་དང་། ལྟོ་གོལ་དང་། རང་དབང་མེད་པ་ལས་ད་ནི་བྲན་མི་བྱེད་པས་མངག་གཞུག་པ་མི་བྱེད།
en: He thinks, ‘I was once a slave, servant, retainer, or bondman and was dependent.

source: གོ་རེ་ལོང་མི་བྱེད། ལྟོ་གོལ་མི་བྱེད་དེ། རང་དབང་ཡོད་དོ་སྙམ་ནས། དེ་གཞི་དེ་ལས་བདེ་བར་གྱུར།
en: But now I am not a slave, servant, retainer, or bondman, and I am independent.’ He becomes happy and satisfied for that reason.

source: ཡིད་བདེ་བར་གྱུར་པ་དང་། མ་སྡུག་དཔེར་ན་མི་ཞིག་བཙོན་དུ་བཟུང་སྟེ།
en: “Ambāṣṭha, as another example, a man is confined in prison and has his hands tied tightly behind his back.

source: ལག་པ་ཕྱིན་ཀ་ལོག་ཏུ་དམ་དུ་བཅིངས་པར་གྱུར་པ་ལས། དེ་དེ་ལས་ནོར་གཞལ་བ་མེད་པར་བདེ་བར་ལེགས་པར་ཐར་ནས།
en: But later he is liberated from being confined in prison and having his hands tied tightly behind his back—safely, successfully, and without paying money.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལྟར་བདག་སྔོན་བཙོན་དུ་བཟུང་སྟེ། ལག་པ་ཕྱིན་ཀ་ལོག་ཏུ་དམ་དུ་བཅིངས་པར་གྱུར་པ་ལས།
en: He thinks, ‘I was once confined in prison and had my hands tied tightly behind my back.

source: ད་ནི་དེ་ལས་བདག་ནོར་གཞལ་བ་མེད་པར་བདེ་བར་ལེགས་པར་ཐར་ཏོ་སྙམ་སྟེ།
en: But now I have been liberated from that situation safely, successfully, and without paying money.’ He becomes happy and satisfied for that reason.

source: དེ་གཞི་དེ་ལས་ཡིད་བདེ་བར་གྱུར་པ་དང་། མ་སྡུག་དཔེར་ན་མི་ཞིག་འཇིགས་པ་ལས་བདེ་བ་དང་། ལོ་ཉེས་པ་ལས་ལོ་ལེགས་པར་གྱུར་ནས།
en: “Ambāṣṭha, as another example, a man who had been in fear becomes safe, and he who had had a very poor harvest gains abundant food.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འདི་ལྟར་བདག་འཇིགས་པ་ལས་བདེ་བ་དང་། ལོ་ཉེས་པ་ལས་ལོ་ལེགས་པར་གྱུར་ཏོ་སྙམ་སྟེ། དེ་གཞི་དེ་ལས་བདེ་བར་གྱུར།
en: He thinks, ‘Thus I, who was once in fear, became safe, and I, who had a very poor harvest, gained abundant food.’ He becomes happy and satisfied for that reason.

source: དགའ་བར་གྱུར་པ་དེ་བཞིན་དུ་དེས་བདག་ཉིད་ཀྱི་སྒྲིབ་པ་ལྔ་པོ་སྐྱིན་པོ་ཇི་ལྟ་བ་དང་། ནད་ཇི་ལྟ་བ་དང་། བྲན་ཇི་ལྟ་བ་དང་། བཙོན་ཇི་ལྟ་བ་དང་། འཇིགས་པ་ཇི་ལྟ་བ་དེ་དག་སྤངས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །དེ་སྒྲིབ་པ་ལྔ་པོ་སེམས་ཉེ་བའི་ཉོན་མོངས་པར་བྱེད་པ། ཤེས་རབ་ཉམ་ཆུང་བར་བྱེད་པ། གནོད་པའི་ཕྱོགས་དང་མཐུན་པ། མྱ་ངན་ལས་འདས་པ་དང་མི་མཐུན་པ་དག་སྤངས་ནས།
en: “In this manner, having abandoned the five obstacles, which are like that debt, illness, servitude, prison, and fear, he observes correctly.

source: འདོད་པ་དག་ལས་དབེན། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན། རྟོག་པ་དང་བཅས། དཔྱོད་པ་དང་བཅས། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: “Having abandoned the five obstacles, which cause lesser defilements of the mind, reduce intelligence, are associated with harm, and are not associated with nirvāṇa, he is free from desires, free from evil and unwholesome elements, and he dwells having achieved the first dhyāna, which is endowed with thought, investigation, pleasure, and happiness produced from solitude.

source: །དཔེར་ན་ཁྲུས་མཁན་ནམ་ཁྲུས་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་ཁར་ཕོར་རམ། གཞོང་བུའམ། ཉ་ཕྱིས་ཀྱི་ནང་དུ་འདག་ཆལ་གྱི་ཕྱེ་མ་ཞིབ་མོ་ཆུས་ཡང་བཏབ་ཡང་བཏབ་སྟེ་སྤངས་ན་འདག་ཆལ་གྱི་གོང་བུ་དེ་གཤེར་གཤེར་དང་ལྡན། གཤེར་གྱིས་ཞེན་ཏེ། གཤེར་གྱིས་ཕྱི་ནང་ཁྱབ་པས་འབོ་བར་མི་འགྱུར།
en: “As an analogy, if a bath attendant or a skillful pupil of a bath attendant moistens fine soap powder with water in a bronze bowl, a wooden tub, or a shell, the lump of soap becomes wet, grows thick with moisture, and does not drop or fall because its inside and outside are fully moisturized.

source: འཛག་པར་མི་འགྱུར་བ་དེ་བཞིན་དུ། དགེ་སློང་དེའི་ལུས་དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བའི་བདེ་བས་མངོན་དུ་རླན་པར་བྱེད། ཡོངས་སུ་རླན་པར་བྱེད། ཡོངས་སུ་ཚིམ་པར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད་དེ། དེའི་ལུས་ཐམས་ཅད་ལ་འདི་ལྟ་སྟེ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བས་མ་ཁྱབ་པའམ།
en: So too, the body of the monk is completely immersed, perfectly immersed, perfectly satisfied, and perfectly filled with pleasure and happiness produced from solitude, and in his body there is no part that is not filled or has not been filled with pleasure and happiness produced from solitude.

source: ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ།
en: “Then he becomes free from thought and investigation, with complete inner purity.

source: སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །དེ་འདི་སྙམ་དུ་ལུས་འདི་ལ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བས་མངོན་དུ་རླན་པར་བྱེད། ཡོངས་སུ་རླན་པར་བྱེད།
en: Because his mental continuum is concentrated on one point, he dwells having achieved the second dhyāna, which is without thought or investigation and endowed with pleasure and happiness produced from meditation.

source: ཡོངས་སུ་ཚིམ་པར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད་དེ། དེའི་ལུས་ཐམས་ཅད་ལ་འདི་ལྟ་སྟེ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: Thus, his body is completely immersed, perfectly immersed, perfectly satisfied, and perfectly filled with pleasure and happiness produced from meditation, and in his body there is no part that is not filled or has not been filled with pleasure and happiness produced from meditation.

source: །དཔེར་ན་རིའི་རྩེ་ན་བཀོད་མའི་མཚོ་བྲན་ཞིག་ཡོད་པར་གྱུར་ལ།
en: “It is just as, for instance, on the summit of a mountain there may be a spring-fed lake.

source: དེར་ནི་ཤར་ཕྱོགས་ནས་ཀྱང་ཆུ་མི་འབབ་པར་གྱུར་ལ། ལྷོ་ཕྱོགས་ནས་མ་ཡིན། ནུབ་ཕྱོགས་ནས་མ་ཡིན། བྱང་ཕྱོགས་ནས་ཀྱང་ཆུ་མི་འབབ་ལ། དེར་ལྷས་ཀྱང་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་མི་འབེབས་ཏེ།
en: Water does not flow into the lake from the east, or from the south, the west, or the north, and the gods do not bring rain there.

source: གཞན་དུ་ན་བཀོད་མའི་མཚོ་བྲན་དེ་ཉིད་ནས་བཀོད་མའི་ཆུའམ། བཀོད་མའི་ཆུ་ཆེན་པོ་ལུད་ནས་བཀོད་མའི་མཚོ་བྲན་དེ་ཐམས་ཅད་ཆུ་བསིལ་བས་གང་བར་བྱེད། ཡོངས་སུ་གང་བར་བྱེད། ཤིན་ཏུ་གང་བར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད་དེ།
en: However, from that lake itself a fountain or a large spring issues forth and the entire lake is filled, completely filled, fully filled, and completely penetrated with cool water.

source: བཀོད་མའི་མཚོ་བྲན་དེ་ཐམས་ཅད་འདི་ལྟ་སྟེ། ཆུ་བསིལ་བས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །དེ་བཞིན་དུ་ལུས་ལ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བས་མངོན་དུ་རླན་པར་བྱེད། ཡོངས་སུ་རླན་པར་བྱེད།
en: There is no part of that entire lake that is not filled or has not been filled with cool water.

source: །དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ།
en: “Then he becomes free from the desire for pleasure. Thus, abiding in equanimity, he possesses mindfulness and vigilance.

source: བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ་འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: He experiences happiness with his body, and, as explained by the noble ones, he possesses mindfulness, abides in happiness, and is equanimous.

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །དེ་འདི་ལྟར་ལུས་འདི་ལ་དགའ་བ་མེད་པའི་བདེ་བས་མངོན་དུ་རླན་པར་བྱེད། ཡོངས་སུ་རླན་པར་བྱེད། ཡོངས་སུ་ཚིམ་པར་བྱེད།
en: He dwells having achieved the third dhyāna, in which pleasure is absent.

source: ཡོངས་སུ་ཁྱབ་པར་བྱེད་དེ། དེའི་ལུས་ཐམས་ཅད་ལ་འདི་ལྟ་སྟེ། དགའ་བ་མེད་པའི་བདེ་བས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །འདི་ལྟ་སྟེ་དཔེར་ན་ཨུཏྤ་ལའམ། པད་མའམ། ཀུ་མུ་དའམ།
en: Thus, his body is completely immersed, perfectly immersed, perfectly satisfied, and perfectly filled with happiness free from pleasure, and in his body there is no part that is not filled or has not been filled with happiness free from pleasure.

source: པད་མ་དཀར་པོ་ཆུ་ལས་སྐྱེས་ཤིང་ཆུ་ནས་ཆེན་པོར་གྱུར་པ་རྩེས་བཏགས་ཤིང་འདུག་པ་དེ་དག་གི་རྩ་བ་ནས་རྩེ་མོའི་བར་གྱི་གསབ་གསེབ་ནི་འདི་ལྟ་སྟེ། ཆུ་བསིལ་བས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །དེ་བཞིན་དུ་ལུས་ལ་དགའ་བ་མེད་པའི་བདེ་བས་མངོན་དུ་རླན་པར་བྱེད། ཡོངས་སུ་རླན་པར་བྱེད།
en: “And just as, for instance, utpala, padma, kumuda, and puṇḍarīka flowers sprout and grow in water, they are bound between their roots and tips, and there is no part that is not soaked or has not been soaked with cool water, so, too, his body is completely immersed, perfectly immersed, perfectly satisfied, and perfectly filled with happiness free from pleasure, and in his body there is no part that is not filled or has not been filled with happiness free from pleasure.

source: ཡོངས་སུ་ཚིམ་པར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད་དེ། དེའི་ལུས་ཐམས་ཅད་ལ་འདི་ལྟ་སྟེ།
en: “Then he abandons happiness, too.

source: དགའ་བ་མེད་པའི་བདེ་བས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །དེ་བདེ་བ་ཡང་སྤངས་ཏེ་སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Since he has already abandoned pain, and his longing and despair have also disappeared, he dwells having achieved the fourth dhyāna, which is neither happy nor painful, but completely clear, with equanimity and mindfulness.

source: །དེ་འདི་ལྟར་ལུས་འདི་ལ་ཡོངས་སུ་དག་པ་དང་རྣམ་པར་བྱང་བའི་སེམས་ཀྱིས་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Thus, delighted, he dwells with his body filled with a clear and pure mind, complete.

source: །དཔེར་ན་ཁྱིམ་བདག་གམ་ཁྱིམ་བདག་གི་བུས་རས་ཁྲུ་བརྒྱད་པའམ། དགུ་པས་དེ་མགོ་དང་། ལག་པ་དང་། རྐང་པ་གཡོགས་ན། དེའི་མགོ་བོ་དང་། ལག་པ་ནས་རྐང་པའི་བར་ལུས་ཐམས་ཅད་འདི་ལྟ་སྟེ། རས་གཙང་མ་ཡོངས་སུ་དག་པས་མ་ཡོག་པའམ། ཡོག་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: “As an analogy, if a householder or a son of a householder covers his head, hands, and feet with eight or nine cubits of cloth, there is, on his whole body from head to toe, no part that is not covered or has not been covered with pure, clean cloth.

source: །དེ་བཞིན་དུ་དེ་འདི་ལྟར་ལུས་འདི་ལ་ཡོངས་སུ་དག་པ་དང་རྣམ་པར་བྱང་བའི་སེམས་ཀྱིས་མོས་ཏེ།
en: So, too, he dwells delighted, with his body filled with a clear and pure mind, complete.

source: ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དེའི་ལུས་ཐམས་ཅད་ལ་འདི་ལྟ་སྟེ། ཡོངས་སུ་དག་པ་དང་རྣམ་པར་བྱང་བའི་སེམས་ཀྱིས་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: In his body there is no part that is not filled or has not been filled with a clear and pure mind, complete.

source: །མ་སྡུག་གང་གི་ཚེ་ཁོ་ན་འཕགས་པའི་ཉན་ཐོས་ཀྱིས་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དེ་ཁོ་ནའི་ཚེ་དེའི་སེམས་རྒོད་པ་མ་ཡིན། ཞུམ་པ་མ་ཡིན་ནོ།
en: “Ambāṣṭha, when a noble disciple has abandoned happiness and, since he has already abandoned pain, and his longing and despair have disappeared, he dwells having achieved the fourth dhyāna, which is neither happy nor painful, but completely clear with equanimity and mindfulness, his mind is neither weak nor faint.

source: །རྒོད་པ་མེད་ཅིང་ཞུམ་པ་མེད་པས་མི་གཡོ་བར་གནས་པ་ཐོབ་བོ།
en: Because he dwells with neither weakness nor faintness, he is able to dwell steadfastly.

source: །དཔེར་ན་ཁང་པ་རྩེག་མ་འམ། ཁང་པ་རྩེག་མའི་ཁྱམས་སུ་འབྲུ་མར་གྱི་མེ་མར་བུས་པ་དེའི་མེ་ལྕེ་དེ་རླུང་ནས། བྱ་དང་མི་དང་མི་མ་ཡིན་པའི་བར་གྱིས་མ་བསྐྱོད་ཅིང་མ་བསྒུལ་བ་དེའི་ཚེ་རྒོད་པ་མ་ཡིན། ཞུམ་པ་མ་ཡིན་ནོ།
en: “It is just as, for instance, when a seed oil lamp is lit on the top of a house or on a terrace on the top of a house, being not agitated or shaken by the wind, or by a bird, or by a person, or by a nonhuman, its flame grows neither weak nor faint.

source: །རྒོད་པ་མེད་ཅིང་ཞུམ་པ་མེད་པར་གནས་པས་མི་གཡོ་བར་འབར་བ་དེ་བཞིན་དུ།
en: Since it is neither weak nor faint, it blazes steadfastly.

source: མ་སྡུག་གང་གི་ཚེ་འཕགས་པའི་ཉན་ཐོས་ཀྱིས་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པས་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དེའི་ཚེ་དེའི་སེམས་རྒོད་པ་མ་ཡིན་ཞུམ་པ་མ་ཡིན་ནོ།
en: So too, Ambāṣṭha, when a noble disciple has abandoned happiness, and, since he has already abandoned pain, and his longing and despair have also disappeared, he dwells having achieved the fourth dhyāna, which is neither happy nor painful, but completely clear with equanimity and mindfulness, his mind is neither weak nor faint.

source: །རྒོད་པ་མེད་ཅིང་ཞུམ་པ་མེད་པས་མི་གཡོ་བར་གནས་པ་ཐོབ་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Because he dwells without either weakness or faintness, he is able to dwell without agitation, and he thinks thus:

source: བདག་གི་ལུས་ཀྱི་གཟུགས་འདི་ནི་རགས་པ་འབྱུང་བ་ཆེན་པོ་བཞིའི་རྒྱུ་ལས་བྱུང་བ་ཡིན་ཏེ།
en: ‘This form of my body is coarse, generated from the cause of the four great elements.

source: འདི་ལ་བདག་གི་རྣམ་པར་ཤེས་པ་རྟེན་ཅིང་འདི་ལ་གནས་ཏེ།
en: My consciousness adheres to this, dwells in this, and pervades this.

source: འདི་ལ་ཁྱབ་པར་གནས་ཀྱིས་མ་ལ་བདག་གིས་ལུས་འདི་ལས་ཡིད་བསྐྱོད་དེ། །ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་། དམན་པ་མ་ཡིན་པ་ཞིག་མངོན་པར་སྤྲུལ་ལོ་སྙམ་ནས། དེ་ལུས་དེ་ལས་ཡིད་བསྐྱོད་དེ་ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་དམན་པ་མ་ཡིན་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ།
en: Now I will move my consciousness from this body and create another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.’ He then does move his consciousness from the body and creates another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.

source: །མ་སྡུག་དཔེར་ན་ནོར་བུ་བཻ་ཌཱུརྱ་བཟང་པོ་རིགས་དང་ལྡན་པ་གསལ་བ། དང་བ་དྲི་མ་མེད་པ་ཚོན་སྐུད་སྣ་ལྔ་པ་འདི་ལྟ་སྟེ།
en: “Ambāṣṭha, it is just as, for instance, a jewel, an excellent lapis lazuli that is of fair origin and is clear, pure, and stainless, is threaded with a string of five colors, namely, blue, yellow, red, white, and madder.

source: སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་ལ་བརྒྱུས་པ་དེ་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མཐོང་ན་འདི་ནི་སྐུད་པ་ཡིན་ནོ།
en: If a man of keen eyes sees this, he knows thus:

source: །འདི་ནི་ནོར་བུ་ཡིན་ནོ། །འདི་ནི་སྐུད་པས་ནོར་བུ་བརྒྱུས་པ་ཡིན་ནོ་ཞེས་ཤེས་པ་དེ་བཞིན་དུ་དེ་ལུས་དེ་ལས་ཡིད་བསྐྱོད་ནས་ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་། དམན་པ་མ་ཡིན་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ།
en: ‘This is a string, this is a jewel, and this is a jewel threaded with a string.’ So, too, he moves his consciousness from the body and creates another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.

source: །མ་སྡུག་དཔེར་ན་མི་ཞིག་གིས་རྩྭ་མུན་ཛ་ལས་ཐུར་མ་ཕྱུང་བ་དེ་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མཐོང་ན་འདི་ནི་མུན་ཛ་ཡིན་ནོ།
en: “Ambāṣṭha, it is just as, for instance, a man extracts a reed from munja grass. If a man of keen eyes sees this, he knows thus:

source: །འདི་ནི་ཐུར་མ་ཡིན་ཏེ། མུན་ཛ་ལས་ཐུར་མ་ཕྱུང་བ་ཡིན་ནོ། །ཞེས་ཤེས་པ་དེ་བཞིན་དུ་དེ་ལུས་དེ་ལས་ཡིད་བསྐྱོད་ནས་ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་། དམན་པ་མ་ཡིན་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ།
en: ‘This is munja grass, this is a reed, and the reed has been extracted from the munja grass.’ So, too, he moves his consciousness from the body and creates another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.

source: །མ་སྡུག་དཔེར་ན་མི་ཞིག་གིས་ཟ་མ་ཏོག་ནས་སྦྲུལ་ཕྱུང་བ་ན་དེ་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མཐོང་ན་འདི་ནི་ཟ་མ་ཏོག་ཡིན་ནོ།
en: “Ambāṣṭha, it is just as, for instance, a man pulls a snake out of a basket. If a man of keen eyes sees this, he knows thus:

source: །འདི་ནི་སྦྲུལ་ཡིན་ཏེ། ཟ་མ་ཏོག་ནས་སྦྲུལ་ཕྱུང་བ་ཡིན་ནོ་ཞེས་ཤེས་པ་དེ་བཞིན་དུ་དེ་ལུས་དེ་ལས་ཡིད་བསྐྱོད་ནས་ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་། དམན་པ་མ་ཡིན་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ།
en: ‘This is a basket, this is a snake, and the snake has been pulled out of the basket.’ So, too, he moves his consciousness from the body and creates another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.

source: །མ་སྡུག་དཔེར་ན་མི་ཞིག་གིས་རལ་གྲི་ཤུབས་ནས་ཕྱུང་བ་ན་དེ་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མཐོང་ན་འདི་ནི་ཤུབས་ཡིན་ནོ།
en: “Ambāṣṭha, it is just as, for instance, a man takes a sword from its sheath. If a man of keen eyes sees this, he knows thus:

source: །འདི་ནི་རལ་གྲི་ཡིན་ཏེ། རལ་གྲི་ཤུབས་ནས་ཕྱུང་བ་ཡིན་ནོ་ཞེས་ཤེས་པ་དེ་བཞིན་དུ་དེ་ལུས་དེ་ལས་ཡིད་བསྐྱོད་ནས་ལུས་གཞན་ཡིད་ལས་བྱུང་བའི་གཟུགས་དབང་པོ་མ་ཚང་བ་དང་། དམན་པ་མ་ཡིན་པ་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ། །དེ་དེ་ལྟར་མཉམ་པར་བཞག་པའི་སེམས་ཡོངས་སུ་དག་པ། རྣམ་པར་བྱང་བ། ཉོན་མོངས་པ་མེད་པ།
en: ‘This is a sheath, this is a sword, and the sword has been taken from its sheath.’ So, too, he moves his consciousness from the body and creates another body with a form generated from consciousness, and with faculties that are neither wanting nor inferior.

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། དྲང་པོར་གྱུར་པ། ལས་སུ་རུང་བ་ལ་གནས་པ། མི་གཡོ་བ་ཐོབ་པ། རྫུ་འཕྲུལ་གྱི་ཡུལ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་ལ་སེམས་མངོན་པར་གཏོད་པར་བྱེད་དེ།
en: “Thus, with his mind adjusted, clean, pure, free from the primary defilements, free from lesser defilements, straightened, active, and unmoved, he inclines his mind toward the supernormal knowledge with which he actualizes the domains of magical powers.

source: དེ་རྫུ་འཕྲུལ་གྱི་ཡུལ་རྣམ་པ་དུ་མ་ཉམས་སུ་མྱོང་བར་བྱེད་དེ།
en: He enjoys many kinds of domains of magical powers:
